# Pandas

Pandas is a fast, powerful, flexible and easy to use open source data analysis and manipulation tool, built on top of the python programming language. 

Pandas is quite a game changer when it comes to analyzing data with Python and it is one of the most preferred and widely used tools in data munging/wrangling.

Whatâ€™s cool about Pandas is that it takes data (like a CSV or TSV file, or a SQL database) and creates a Python object with rows and columns called data frame that looks very similar to a table in a statistical software (like Excel).

### Advantages of Pandas

Fast and efficient for manipulating and analyzing data. 

Data from different file objects can be loaded. 

Easy handling of missing data (represented as NaN) in floating point as well as non-floating point data 

Size mutability: columns can be inserted and deleted from DataFrame and higher dimensional objects 

Data set merging and joining. 

Flexible reshaping and pivoting of data sets 

Provides time-series functionality. 

Powerful group by functionality for performing split-apply-combine operations on data se

# Data structures in Pandas

Series :
Pandas Series is a one-dimensional labeled array capable of holding any data type. So, in terms of Pandas DataStructure, A Series represents a single column in memory, which is either independent or belongs to a Pandas DataFrame.

Why do we use series in pandas?
Pandas Series is a one-dimensional labeled array capable of holding data of any type (integer, string, float, python objects, etc.). The object supports both integer and label-based indexing and provides a host of methods for performing operations involving the index.

Dataframe : 
Pandas DataFrame is two-dimensional size-mutable, potentially heterogeneous tabular data structure with labeled axes known as rows and columns. a dataframe is a collection of series that can be used to analyse the data.  DataFrame can be created from the lists, dictionary, and from a list of dictionaries etc.

In [1]:
#importing pandas library
import pandas as pd

## Series

Series is a one-dimensional labeled array capable of holding data of any type (integer, string, float, python objects, etc.). The axis labels are collectively called index.

### creating a series from ndarray

In [2]:
import numpy as np

In [6]:
#creating a ndarray from a list to be passed in pandas
data = np.array(['a','b','c','d'])

#creating a series from the ndarray
#the Series has 'S' in capital
s= pd.Series(data)
print(s)

0    a
1    b
2    c
3    d
dtype: object

In [7]:
s

0    a
1    b
2    c
3    d
dtype: object

### creating a series from ndarray with custom indexing

In [11]:
# using index=[] to pass the index number according to our own need
data = np.array([1,2,3,'Hello'])
s = pd.Series(data,index=[101,102,103,104])
s

101        1
102        2
103        3
104    Hello
dtype: object

### creating a series from dictionary

In [13]:
data = {'a': 0,'b':1,'c':2,'d':3.}
s= pd.Series(data)
s

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

# Accessing data from Series

In [14]:
#using position
s = pd.Series([1,2,3,4,5],index=['a','b','c','d','e'])

#retriiving the first element
print(s[0])

1

In [15]:
#retriving the first three element
print(s[:3])

a    1
b    2
c    3
dtype: int64

In [16]:
print(s[2:5])

c    3
d    4
e    5
dtype: int64

In [18]:
print(s[::-1])

e    5
d    4
c    3
b    2
a    1
dtype: int64

In [19]:
print(s[:-1])

a    1
b    2
c    3
d    4
dtype: int64

In [20]:
print(s[-1])

5

### Retrieve data using label(INDEX)

In [21]:
#using 'a' as index
print(s['a'])

1

In [24]:
print(s['a'],s['d'])

1 4

In [25]:
#retrieve multiple elements
print(s[['a','d','e']])

a    1
d    4
e    5
dtype: int64

# Dataframe

Pandas DataFrame is two-dimensional size-mutable, potentially heterogeneous tabular data structure with labeled axes (rows and columns). A Data frame is a two-dimensional data structure, i.e., data is aligned in a tabular fashion in rows and columns. Pandas DataFrame consists of three principal components, the data, rows, and columns.

In [26]:
#creating  a dataframe from list
#create a list first
lst = ['East','Or','West','Noone','is','best']

#calling DataFrame constructor on list 'D and F' capital
df=pd.DataFrame(lst)
print(df)

       0
0   East
1     Or
2   West
3  Noone
4     is
5   best

In [27]:
df

       0
0   East
1     Or
2   West
3  Noone
4     is
5   best

In [28]:
#creating a DataFrame from ndarray

#initializing data of lists
data = {'Name':['POD1','POD2','POD3','POD4'],
        'Age':[20,21,22,23],
        'Gender': ['M','F','M','F']
       }

#creating a DataFrame
df = pd.DataFrame(data)

print(df)

   Name  Age Gender
0  POD1   20      M
1  POD2   21      F
2  POD3   22      M
3  POD4   23      F

In [29]:
df

   Name  Age Gender
0  POD1   20      M
1  POD2   21      F
2  POD3   22      M
3  POD4   23      F

In [30]:
s

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [33]:
#creating a DataFrame from a Series
deff=pd.DataFrame(s)
print(deff)

   0
a  1
b  2
c  3
d  4
e  5

In [34]:
deff

   0
a  1
b  2
c  3
d  4
e  5

In [35]:
#creating a DataFrame from List of Dictionaries
data=[{'a':1,'b':2},{'a':5,'b':10,'c':20}]

df=pd.DataFrame(data)
print(df)

   a   b     c
0  1   2   NaN
1  5  10  20.0

In [36]:
df

   a   b     c
0  1   2   NaN
1  5  10  20.0

In [39]:
#with two column indixes,values smae as dictionary keys
df1 = pd.DataFrame(data,index=['First','Second'],columns=['a','b'])

print(df1)
df1

        a   b
First   1   2
Second  5  10

        a   b
First   1   2
Second  5  10

### creating empty Dataframe

In [43]:
#first way
df=pd.DataFrame()

#2nd way
df=pd.DataFrame(columns=['col1','col2'])

In [44]:
df

Empty DataFrame
Columns: [col1, col2]
Index: []

### Column selection in a DataFrame

In [48]:
#creating a DataFrame from ndarray

#initializing data of lists
data = {'Name':['POD1','POD2','POD3','POD4'],
        'Age':[20,21,22,23],
        'Gender': ['M','F','M','F']
       }

#creating a DataFrame
df = pd.DataFrame(data)

print(df)

   Name  Age Gender
0  POD1   20      M
1  POD2   21      F
2  POD3   22      M
3  POD4   23      F

In [49]:
df

   Name  Age Gender
0  POD1   20      M
1  POD2   21      F
2  POD3   22      M
3  POD4   23      F

In [52]:
# column selection

#single column selection in DataFrame
print(df['Gender'])


#multiple column selection in DataFrame
#use column names in [] to access the columns
df[['Name','Age']]

0    M
1    F
2    M
3    F
Name: Gender, dtype: object

   Name  Age
0  POD1   20
1  POD2   21
2  POD3   22
3  POD4   23

In [53]:
#to access all the columns
df

   Name  Age Gender
0  POD1   20      M
1  POD2   21      F
2  POD3   22      M
3  POD4   23      F

### Row selection in a DataFrame

In [58]:
# Row selection

#retirviing row by iloc method at 0th index
print(df.iloc[0])

#retriving the row with iloc method for 0th and 1st index
df.iloc[[0,1]]

Name      POD1
Age         20
Gender       M
Name: 0, dtype: object

   Name  Age Gender
0  POD1   20      M
1  POD2   21      F

In [59]:
#retriving the row at the last index
df.iloc[-1]

Name      POD4
Age         23
Gender       F
Name: 3, dtype: object

In [60]:
df.iloc[::-2]

   Name  Age Gender
3  POD4   23      F
1  POD2   21      F

In [61]:
df.iloc[:-2]

   Name  Age Gender
0  POD1   20      M
1  POD2   21      F

In [62]:
df.iloc[0:2]

   Name  Age Gender
0  POD1   20      M
1  POD2   21      F

In [63]:
#accessing last two rows
df.iloc[-2:]

   Name  Age Gender
2  POD3   22      M
3  POD4   23      F

## Dropping column or rows in a DataFrame

In [64]:
#dropping columns in a DataFrame

#here axis 1 is used for column and axis = 0 is used for Rows
print(df)

df.drop(['Age'],axis=1)

   Name  Age Gender
0  POD1   20      M
1  POD2   21      F
2  POD3   22      M
3  POD4   23      F

   Name Gender
0  POD1      M
1  POD2      F
2  POD3      M
3  POD4      F

In [65]:
# dropping rows in a DataFrame, using index of the row

# here axis= 1 is used for column and axis=0 is for rows
print(df)

# first argumnet is 0=index and second is for row
df.drop(0,axis=0)

   Name  Age Gender
0  POD1   20      M
1  POD2   21      F
2  POD3   22      M
3  POD4   23      F

   Name  Age Gender
1  POD2   21      F
2  POD3   22      M
3  POD4   23      F

### Transpose of a DataFrame

In [66]:
print(df)

df.T

   Name  Age Gender
0  POD1   20      M
1  POD2   21      F
2  POD3   22      M
3  POD4   23      F

           0     1     2     3
Name    POD1  POD2  POD3  POD4
Age       20    21    22    23
Gender     M     F     M     F

### Extracting column of a DataFrame

In [67]:
#extracting column name of a DataFrame
df.columns

Index(['Name', 'Age', 'Gender'], dtype='object')

In [69]:
# dropping the columns and rows doesnt cahnges the original
# DataFrame as it only gives an instantaneous result for the action
df

   Name  Age Gender
0  POD1   20      M
1  POD2   21      F
2  POD3   22      M
3  POD4   23      F

### Getting Datatypes of columns in a DataFrame

In [70]:
#datatypes of the columns in a DataFrame

#use dtypes method
df.dtypes

Name      object
Age        int64
Gender    object
dtype: object

### Value distribution of a DataFrame

In [73]:
# value distribution in a DataFrmae

df.value_counts()

AttributeError: 'DataFrame' object has no attribute 'value_counts'

# Reading and Saving DataFrames

Ah, the good old CSV format. A CSV (or Comma Separated Value) file is the most common type of file that a data scientist will ever work with. These files use a â€œ,â€ as a delimiter to separate the values and each row in a CSV file is a data record.

These are useful to transfer data from one application to another and is probably the reason why they are so commonplace in the world of data science.

If you look at them in the Notepad, you will notice that the values are separated by commas:

## Few File access mode:

â€˜wâ€™ â€“ writing to a file

â€˜r+â€™ or â€˜w+â€™ â€“ read and write to a file

â€˜aâ€™ â€“ appending to an already existing file

â€˜a+â€™ â€“ append to a file after reading

The Pandas library makes it very easy to read CSV files using the read_csv() function:

In [74]:
# creating a data dictionary 
data = {
    'CHN': {'COUNTRY': 'China', 'POP': 1_398.72, 'AREA': 9_596.96,
            'GDP': 12_234.78, 'CONT': 'Asia'},
    'IND': {'COUNTRY': 'India', 'POP': 1_351.16, 'AREA': 3_287.26,
            'GDP': 2_575.67, 'CONT': 'Asia', 'IND_DAY': '1947-08-15'},
    'USA': {'COUNTRY': 'US', 'POP': 329.74, 'AREA': 9_833.52,
            'GDP': 19_485.39, 'CONT': 'N.America',
            'IND_DAY': '1776-07-04'},
    'IDN': {'COUNTRY': 'Indonesia', 'POP': 268.07, 'AREA': 1_910.93,
            'GDP': 1_015.54, 'CONT': 'Asia', 'IND_DAY': '1945-08-17'},
    'BRA': {'COUNTRY': 'Brazil', 'POP': 210.32, 'AREA': 8_515.77,
            'GDP': 2_055.51, 'CONT': 'S.America', 'IND_DAY': '1822-09-07'},
    'PAK': {'COUNTRY': 'Pakistan', 'POP': 205.71, 'AREA': 881.91,
            'GDP': 302.14, 'CONT': 'Asia', 'IND_DAY': '1947-08-14'},
    
}

columns = ('COUNTRY', 'POP', 'AREA', 'GDP', 'CONT', 'IND_DAY')

In [75]:
data

{'CHN': {'COUNTRY': 'China',
  'POP': 1398.72,
  'AREA': 9596.96,
  'GDP': 12234.78,
  'CONT': 'Asia'},
 'IND': {'COUNTRY': 'India',
  'POP': 1351.16,
  'AREA': 3287.26,
  'GDP': 2575.67,
  'CONT': 'Asia',
  'IND_DAY': '1947-08-15'},
 'USA': {'COUNTRY': 'US',
  'POP': 329.74,
  'AREA': 9833.52,
  'GDP': 19485.39,
  'CONT': 'N.America',
  'IND_DAY': '1776-07-04'},
 'IDN': {'COUNTRY': 'Indonesia',
  'POP': 268.07,
  'AREA': 1910.93,
  'GDP': 1015.54,
  'CONT': 'Asia',
  'IND_DAY': '1945-08-17'},
 'BRA': {'COUNTRY': 'Brazil',
  'POP': 210.32,
  'AREA': 8515.77,
  'GDP': 2055.51,
  'CONT': 'S.America',
  'IND_DAY': '1822-09-07'},
 'PAK': {'COUNTRY': 'Pakistan',
  'POP': 205.71,
  'AREA': 881.91,
  'GDP': 302.14,
  'CONT': 'Asia',
  'IND_DAY': '1947-08-14'}}

In [76]:
columns

('COUNTRY', 'POP', 'AREA', 'GDP', 'CONT', 'IND_DAY')

In [77]:
#creating a DataFrame
# data is organized in such a way that the country codes correspond to columns. 
# to reverse(Transpose) the rows and columns of a DataFrame with the property .T:

df= pd.DataFrame(data)

In [78]:
df

             CHN         IND         USA         IDN         BRA         PAK
COUNTRY    China       India          US   Indonesia      Brazil    Pakistan
POP      1398.72     1351.16      329.74      268.07      210.32      205.71
AREA     9596.96     3287.26     9833.52     1910.93     8515.77      881.91
GDP      12234.8     2575.67     19485.4     1015.54     2055.51      302.14
CONT        Asia        Asia   N.America        Asia   S.America        Asia
IND_DAY      NaN  1947-08-15  1776-07-04  1945-08-17  1822-09-07  1947-08-14

In [79]:
df.T

       COUNTRY      POP     AREA      GDP       CONT     IND_DAY
CHN      China  1398.72  9596.96  12234.8       Asia         NaN
IND      India  1351.16  3287.26  2575.67       Asia  1947-08-15
USA         US   329.74  9833.52  19485.4  N.America  1776-07-04
IDN  Indonesia   268.07  1910.93  1015.54       Asia  1945-08-17
BRA     Brazil   210.32  8515.77  2055.51  S.America  1822-09-07
PAK   Pakistan   205.71   881.91   302.14       Asia  1947-08-14

### To export a DataFrame to .csv file format

In [80]:
#write a CSV file
df.to_csv('data.csv',index=False)

### Reading CSV files

In [82]:
#to verify that we saved teh data to a csv file that is saved to current
#working directory we can import it or read it

#read csv file into a DataFrame
df=pd.read_csv('data.csv')

df

        CHN         IND         USA         IDN         BRA         PAK
0     China       India          US   Indonesia      Brazil    Pakistan
1   1398.72     1351.16      329.74      268.07      210.32      205.71
2   9596.96     3287.26     9833.52     1910.93     8515.77      881.91
3  12234.78     2575.67    19485.39     1015.54     2055.51      302.14
4      Asia        Asia   N.America        Asia   S.America        Asia
5       NaN  1947-08-15  1776-07-04  1945-08-17  1822-09-07  1947-08-14

In [83]:
df.T

             0        1        2         3          4           5
CHN      China  1398.72  9596.96  12234.78       Asia         NaN
IND      India  1351.16  3287.26   2575.67       Asia  1947-08-15
USA         US   329.74  9833.52  19485.39  N.America  1776-07-04
IDN  Indonesia   268.07  1910.93   1015.54       Asia  1945-08-17
BRA     Brazil   210.32  8515.77   2055.51  S.America  1822-09-07
PAK   Pakistan   205.71   881.91    302.14       Asia  1947-08-14

### To save data in excel file format

In [85]:
#write to an excel file
df.to_excel('data.xlsx')

### Reading excel files

Most of you will be quite familiar with Excel files and why they are so widely used to store tabular data. So Iâ€™m going to jump right to the code and import an Excel file in Python using Pandas.

Pandas has a very handy function called read_excel() to read Excel files:

In [86]:
#read an excel file
df=pd.read_excel('data.xlsx', index_col=0)

df

        CHN         IND         USA         IDN         BRA         PAK
0     China       India          US   Indonesia      Brazil    Pakistan
1   1398.72     1351.16      329.74      268.07      210.32      205.71
2   9596.96     3287.26     9833.52     1910.93     8515.77      881.91
3  12234.78     2575.67    19485.39     1015.54     2055.51      302.14
4      Asia        Asia   N.America        Asia   S.America        Asia
5       NaN  1947-08-15  1776-07-04  1945-08-17  1822-09-07  1947-08-14

# DataFrame Operations

In [97]:
# creating a dataframe .
df = pd.DataFrame({'Region':['West','North','South'],
                   'Company':['Costco','Walmart','Home Depot'],
                   'Product':['Dinner Set','Grocery','Gardening tools'],
                   'Month':['September','July','February'],
                   'Sales':[2500,3096,8795]})

df

  Region     Company          Product      Month  Sales
0   West      Costco       Dinner Set  September   2500
1  North     Walmart          Grocery       July   3096
2  South  Home Depot  Gardening tools   February   8795

In [98]:
# New Data Row for East Region:
# This is a data dictionary with the values of one Region - East that we want to enter in the above dataframe df.


data = [{'Region':'East','Company':'Shop Rite','Product':'Fruits','Month':'December','Sales': 1265}]

### Adding rows to the DataFrame

In [99]:
#using append function

#It basically creates a new dataframe object with the new data row at the end of the dataframe.
#The old dataframe will be unchanged.

df.append(data,ignore_index=True,sort=False)

  Region     Company          Product      Month  Sales
0   West      Costco       Dinner Set  September   2500
1  North     Walmart          Grocery       July   3096
2  South  Home Depot  Gardening tools   February   8795
3   East   Shop Rite           Fruits   December   1265

In [100]:
#The old dataframe will be unchanged.
df

  Region     Company          Product      Month  Sales
0   West      Costco       Dinner Set  September   2500
1  North     Walmart          Grocery       July   3096
2  South  Home Depot  Gardening tools   February   8795

In [101]:
#not ignoring index will add the new data with '0' index and sort will sort according to the column name
df.append(data,ignore_index=False,sort=True)

      Company      Month          Product Region  Sales
0      Costco  September       Dinner Set   West   2500
1     Walmart       July          Grocery  North   3096
2  Home Depot   February  Gardening tools  South   8795
0   Shop Rite   December           Fruits   East   1265

In [102]:
#using loc to insert a row
#loc is used to access a group of rows and columns by labels or a boolean array. However with an assignment(=) operator you 
#can also set the value of a cell or insert a new row all together at the bottom of the dataframe.

print(df)

df.loc[3]=list(data[0].values())
df

  Region     Company          Product      Month  Sales
0   West      Costco       Dinner Set  September   2500
1  North     Walmart          Grocery       July   3096
2  South  Home Depot  Gardening tools   February   8795

  Region     Company          Product      Month  Sales
0   West      Costco       Dinner Set  September   2500
1  North     Walmart          Grocery       July   3096
2  South  Home Depot  Gardening tools   February   8795
3   East   Shop Rite           Fruits   December   1265

In [103]:
df

  Region     Company          Product      Month  Sales
0   West      Costco       Dinner Set  September   2500
1  North     Walmart          Grocery       July   3096
2  South  Home Depot  Gardening tools   February   8795
3   East   Shop Rite           Fruits   December   1265

In [106]:
#using iloc to update row at index position
#We can replace a row with the new data as well using iloc, which is integer-location based indexing for selection by position.
#In our original dataframe we want to replace the data for North Region with the new data of the East Region. Update the row at index 
#position 1 using iloc and list values of the data dictionary

print(df)

df.iloc[1]=list(data[0].values())
df

  Region     Company          Product      Month  Sales
0   West      Costco       Dinner Set  September   2500
1   East   Shop Rite           Fruits   December   1265
2  South  Home Depot  Gardening tools   February   8795
3   East   Shop Rite           Fruits   December   1265

  Region     Company          Product      Month  Sales
0   West      Costco       Dinner Set  September   2500
1   East   Shop Rite           Fruits   December   1265
2  South  Home Depot  Gardening tools   February   8795
3   East   Shop Rite           Fruits   December   1265

### Adding new column to DataFrame

In [107]:
# column to be added is below
purchase = [3000,4000,3500,6000]

#now to assign it to a new column called Purchase
df.assign(Purchase=purchase)

  Region     Company          Product      Month  Sales  Purchase
0   West      Costco       Dinner Set  September   2500      3000
1   East   Shop Rite           Fruits   December   1265      4000
2  South  Home Depot  Gardening tools   February   8795      3500
3   East   Shop Rite           Fruits   December   1265      6000

### Adding multiple columns to the DataFrame

Lets add these three list (Date, City, Purchase) as column to the 
existing dataframe using assign with a dict of column names and values

In [108]:
Date = ['1/9/2017','2/6/2018','7/12/2018','9/12/2018']
City = ['SFO', 'Chicago', 'Charlotte','denmark']
Purchase = [3000, 4000, 3500,5000]

df.assign(**{'City' : City, 'Date' : Date,'Purchase':Purchase})

,Region,Company,Product,Month,Sales,City,Date,Purchase
0,West,Costco,Dinner Set,September,2500,SFO,1/9/2017,3000
1,East,Shop Rite,Fruits,December,1265,Chicago,2/6/2018,4000
2,South,Home Depot,Gardening tools,February,8795,Charlotte,7/12/2018,3500
3,East,Shop Rite,Fruits,December,1265,denmark,9/12/2018,5000

### Deleting Rows/Columns

Remove rows or columns by specifying label names and corresponding axis, or by specifying directly index or column names.

#### Syntax: DataFrame.drop(labels=None, axis=0, index=None, columns=None,level=None,inplace=False, errors='raise')

In [109]:
#using the above DataFrame for further operations
df

  Region     Company          Product      Month  Sales
0   West      Costco       Dinner Set  September   2500
1   East   Shop Rite           Fruits   December   1265
2  South  Home Depot  Gardening tools   February   8795
3   East   Shop Rite           Fruits   December   1265

In [111]:
#dropping cloumns that is axis=1
print(df)

df.drop(['Region','Company'],axis=1)

  Region     Company          Product      Month  Sales
0   West      Costco       Dinner Set  September   2500
1   East   Shop Rite           Fruits   December   1265
2  South  Home Depot  Gardening tools   February   8795
3   East   Shop Rite           Fruits   December   1265

           Product      Month  Sales
0       Dinner Set  September   2500
1           Fruits   December   1265
2  Gardening tools   February   8795
3           Fruits   December   1265

In [113]:
#alternate method
print(df)

df.drop(columns=['Region','Company'])

  Region     Company          Product      Month  Sales
0   West      Costco       Dinner Set  September   2500
1   East   Shop Rite           Fruits   December   1265
2  South  Home Depot  Gardening tools   February   8795
3   East   Shop Rite           Fruits   December   1265

           Product      Month  Sales
0       Dinner Set  September   2500
1           Fruits   December   1265
2  Gardening tools   February   8795
3           Fruits   December   1265

In [116]:
# Dropping a row with axis=0
print(df)

df.drop([0],axis=0)

  Region     Company          Product      Month  Sales
0   West      Costco       Dinner Set  September   2500
1   East   Shop Rite           Fruits   December   1265
2  South  Home Depot  Gardening tools   February   8795
3   East   Shop Rite           Fruits   December   1265

  Region     Company          Product     Month  Sales
1   East   Shop Rite           Fruits  December   1265
2  South  Home Depot  Gardening tools  February   8795
3   East   Shop Rite           Fruits  December   1265

In [117]:
# dropping rows by index only
print(df)

df.drop([0,1])

  Region     Company          Product      Month  Sales
0   West      Costco       Dinner Set  September   2500
1   East   Shop Rite           Fruits   December   1265
2  South  Home Depot  Gardening tools   February   8795
3   East   Shop Rite           Fruits   December   1265

  Region     Company          Product     Month  Sales
2  South  Home Depot  Gardening tools  February   8795
3   East   Shop Rite           Fruits  December   1265

### Sorting DataFrames (ascending/descending)

To sort the DataFrame based on the values in a single column, use .sort_values(). By default,
this will return a new DataFrame sorted in ascending order. It does not modify the original DataFrame.

### Syntax:
#### DataFrame.sort_values(by, axis=0, ascending=True, inplace=False, kind='quicksort', na_position='last', ignore_index=False, key=None)

Axis: {0 or â€˜indexâ€™, 1 or â€˜columnsâ€™}, default 0.
Ascending : bool or list of bool, default True.
Inplace : bool, default False . If True, perform operation in-place.

In [118]:
df = pd.DataFrame({
    'col1': ['A', 'A', 'B', np.nan, 'D', 'C'],
    'col2': [2, 1, 9, 8, 7, 4],
    'col3': [0, 1, 9, 4, 2, 3],
    'col4': ['a', 'B', 'c', 'D', 'e', 'F']
})

In [119]:
df

  col1  col2  col3 col4
0    A     2     0    a
1    A     1     1    B
2    B     9     9    c
3  NaN     8     4    D
4    D     7     2    e
5    C     4     3    F

In [120]:
# sorting according to column 1 (ascending)
df.sort_values('col1')

  col1  col2  col3 col4
0    A     2     0    a
1    A     1     1    B
2    B     9     9    c
5    C     4     3    F
4    D     7     2    e
3  NaN     8     4    D

In [123]:
# this is also same as above just the differnece is we can pass more paramenters
#but the main sorting is done according to the first column name passed
df.sort_values(by=['col1','col2'])

  col1  col2  col3 col4
1    A     1     1    B
0    A     2     0    a
2    B     9     9    c
5    C     4     3    F
4    D     7     2    e
3  NaN     8     4    D

In [124]:
# sorting according to column 1 (descending)
df.sort_values(by='col1',ascending=False)

  col1  col2  col3 col4
4    D     7     2    e
5    C     4     3    F
2    B     9     9    c
0    A     2     0    a
1    A     1     1    B
3  NaN     8     4    D

### Null Handling

There are numerous ways to detect the presence of missing values in a dataset.

First , we will create a dataframe in which we will take one of the value as missing (Null)

In [125]:
# initialize list of lists
data = [['Adam', 10], ['Steve', 15], ['John', ]] #Taking value (age) for john is Null
 
# Create the pandas DataFrame
df = pd.DataFrame(data, columns = ['Name', 'Age'])
 
# print dataframe.
df

    Name   Age
0   Adam  10.0
1  Steve  15.0
2   John   NaN

#### isna()

The isna() function is used to check missing (null) values. It is a boolean function that looks for the missing values and returns TRUE where it detects a missing value.

In this example, we have made use of isna() function to check for the presence of missing values. The cell of the dataframe containing missing values only returns TRUE, otherwise it returns FALSE.

In [126]:
df.isna()

    Name    Age
0  False  False
1  False  False
2  False   True

In [128]:
# we can also use isna() in pandas series

#creating the sereis
ser = pd.Series([12,5,None,5,None,11])

#print the series
ser

0    12.0
1     5.0
2     NaN
3     5.0
4     NaN
5    11.0
dtype: float64

In [129]:
# to detect missing values
ser.isna()

0    False
1    False
2     True
3    False
4     True
5    False
dtype: bool

#### notna()

Similarly We have notna(). With notna() function, we can easily pick out data that does not 
occupy missing values or NA values. The notna() function returns TRUE,
if the data is free from missing values else it returns FALSE (if null values are encountered).

or in simple words The notna() function returns TRUE, if the data is free from missing values 
else it returns FALSE (if NA values are encountered).

In [131]:
df

    Name   Age
0   Adam  10.0
1  Steve  15.0
2   John   NaN

In [132]:
df.notna()

   Name    Age
0  True   True
1  True   True
2  True  False

#### isnull()

isnull() function also works the same as isna(), detects missing values in the given series or dataframe. It returns a boolean same-sized object indicating if the values are NA (null). Missing values get mapped to True and non-missing values get mapped to False.

In [133]:
df.isnull()

    Name    Age
0  False  False
1  False  False
2  False   True

In [134]:
ser.isnull()

0    False
1    False
2     True
3    False
4     True
5    False
dtype: bool

#### notnull()

works similar as notna()

In [135]:
df.notnull()

   Name    Age
0  True   True
1  True   True
2  True  False

In [136]:
ser.notnull()

0     True
1     True
2    False
3     True
4    False
5     True
dtype: bool

#### replace()

Pandas replace() is a very rich function that is used to replace a string, regex, dictionary, list, and series from the DataFrame. The values of the DataFrame can be replaced with other values dynamically. It is capable of working with the Python regex (regular expression). It differs from updating with .loc or .iloc, which requires you to specify a location where you want to update with some value.

#### Syntax: DataFrame.replace(to_replace= â€œ â€, value=â€ â€)

In [137]:
df

    Name   Age
0   Adam  10.0
1  Steve  15.0
2   John   NaN

In [138]:
#this will replace "john" wiht "Michael"
df.replace(to_replace='John',value='Michael')

      Name   Age
0     Adam  10.0
1    Steve  15.0
2  Michael   NaN

In [139]:
#initialize data of lists
data = {'Name':['Tom', 'nick', 'krish', 'jack','steve','David','Adam'],
        'Subject':['Maths','Bio','Phy','Bio','Maths','Bio','Phy']}
 
# Create DataFrame
dff = pd.DataFrame(data)
 
# Print the output.
dff

    Name Subject
0    Tom   Maths
1   nick     Bio
2  krish     Phy
3   jack     Bio
4  steve   Maths
5  David     Bio
6   Adam     Phy

In [140]:
## to replace more than one element/value at a time

dff.replace(to_replace=['Bio','Phy'],value='Science')
#using python list as an argument we are going to replace 'Phy and 'bio' with 'Science'

    Name  Subject
0    Tom    Maths
1   nick  Science
2  krish  Science
3   jack  Science
4  steve    Maths
5  David  Science
6   Adam  Science

#### we can replace missing values using replace() function

In [141]:
#Replace the Nan value in the data frame with a specific value

#Let us try to replace missing values (age of john) with 12.0

print(df)

#use numpy.nan for NaN values
df.replace(to_replace=np.nan,value=12.0)

    Name   Age
0   Adam  10.0
1  Steve  15.0
2   John   NaN

    Name   Age
0   Adam  10.0
1  Steve  15.0
2   John  12.0

#### fillna()

fillna() manages and lets the user replace NaN values with some value of their own.

#### Syntax: dataframe["Column name"].fillna("Value", inplace = True)

In [143]:
#filling NaN values with mean of age

print(df)

df['Age'].fillna(df['Age'].mean())

    Name   Age
0   Adam  10.0
1  Steve  15.0
2   John   NaN

0    10.0
1    15.0
2    12.5
Name: Age, dtype: float64

In [144]:
#replacing missing values in age with 'Age missing'
print(df)

df['Age'].fillna('Age missing', inplace=True)

    Name   Age
0   Adam  10.0
1  Steve  15.0
2   John   NaN

In [145]:
df

    Name          Age
0   Adam           10
1  Steve           15
2   John  Age missing

### Aggregation of Groups (Group By):

Pandas group by is used for grouping the data according to the categories and apply a function to the categories. It also helps to aggregate data efficiently. Pandas dataframe.groupby() function is used to split the data into groups based on some criteria.

In this play, you will learn how to do analysis on groups(individual categories) in a pandas dataframe of a categorical feature. The concept of split-apply-combine, manipulates groups separately based on different rules.

When you are working on a dataset, be it data preparation phase, EDA phase, you will often come upon a situation where you would like to get some statistical inference from the data within each individual category.

#### Syntax - DataFrame.groupby(by=None, axis=0, level=None, as_index=True, sort=True, group_keys=True, squeeze=False)

In [146]:
"""
  Lets start with a assumption that there is a class of 300 students and they have given there one fav subject a rating in range of 1-10 from 6 unique subject .
"""
n_studs = 10
HouseOne = pd.DataFrame({
    "Name":["Name_"+str(i) for i in range(n_studs)],
    "Subject":np.random.choice(["Subject_"+str(i) for i in range(6)], size=n_studs),
    "Rating":np.random.uniform(low=1, high=10, size=n_studs),
    "Num":np.random.randint(low=1, high=10, size=n_studs)
})

In [147]:
HouseOne.sample(10) #will give you 10 random points in any order

     Name    Subject    Rating  Num
0  Name_0  Subject_2  7.359070    1
1  Name_1  Subject_1  2.256429    9
8  Name_8  Subject_1  4.517184    2
3  Name_3  Subject_4  6.564757    2
9  Name_9  Subject_4  8.606973    3
2  Name_2  Subject_2  5.950969    5
5  Name_5  Subject_0  7.722914    8
6  Name_6  Subject_3  7.097788    8
4  Name_4  Subject_3  5.094285    1
7  Name_7  Subject_0  8.935053    1

In [148]:
"""
Hold on here a second, notice groupby("Subject") will filter you data into groups of each individual unique subject and return a groupby OBJECT.!, 
if you iterate over these objects you get a tuple of group name(here, subname & the filtered data)
"""
for name in HouseOne.groupby("Subject"):
    print(f"Group Name is {name}")

Group Name is ('Subject_0',      Name    Subject    Rating  Num
5  Name_5  Subject_0  7.722914    8
7  Name_7  Subject_0  8.935053    1)
Group Name is ('Subject_1',      Name    Subject    Rating  Num
1  Name_1  Subject_1  2.256429    9
8  Name_8  Subject_1  4.517184    2)
Group Name is ('Subject_2',      Name    Subject    Rating  Num
0  Name_0  Subject_2  7.359070    1
2  Name_2  Subject_2  5.950969    5)
Group Name is ('Subject_3',      Name    Subject    Rating  Num
4  Name_4  Subject_3  5.094285    1
6  Name_6  Subject_3  7.097788    8)
Group Name is ('Subject_4',      Name    Subject    Rating  Num
3  Name_3  Subject_4  6.564757    2
9  Name_9  Subject_4  8.606973    3)

In [149]:
for name, group in HouseOne.groupby("Subject"):
    print(f"Group Name is {name}")

Group Name is Subject_0
Group Name is Subject_1
Group Name is Subject_2
Group Name is Subject_3
Group Name is Subject_4

In [150]:
%%time
for name, group in HouseOne.groupby("Subject"):
    print(f"Subject Name is {name} and Subject Avg. rating is {group['Rating'].mean()}") # now we know groups represent the subjects

Subject Name is Subject_0 and Subject Avg. rating is 8.328983513007476
Subject Name is Subject_1 and Subject Avg. rating is 3.3868063576499434
Subject Name is Subject_2 and Subject Avg. rating is 6.655019268205866
Subject Name is Subject_3 and Subject Avg. rating is 6.096036157230829
Subject Name is Subject_4 and Subject Avg. rating is 7.585864570674043
Wall time: 8 ms

In [151]:
for name, group in HouseOne.groupby("Subject"):
    print(f"Now Printing Filtered Data of only : {name}")
    print("*"*50)
    print(group.head(3))
    print("*"*50)

Now Printing Filtered Data of only : Subject_0
**************************************************
     Name    Subject    Rating  Num
5  Name_5  Subject_0  7.722914    8
7  Name_7  Subject_0  8.935053    1
**************************************************
Now Printing Filtered Data of only : Subject_1
**************************************************
     Name    Subject    Rating  Num
1  Name_1  Subject_1  2.256429    9
8  Name_8  Subject_1  4.517184    2
**************************************************
Now Printing Filtered Data of only : Subject_2
**************************************************
     Name    Subject    Rating  Num
0  Name_0  Subject_2  7.359070    1
2  Name_2  Subject_2  5.950969    5
**************************************************
Now Printing Filtered Data of only : Subject_3
**************************************************
     Name    Subject    Rating  Num
4  Name_4  Subject_3  5.094285    1
6  Name_6  Subject_3  7.097788    8
**************************************************
Now Printing Filtered Data of only : Subject_4
**************************************************
     Name    Subject    Rating  Num
3  Name_3  Subject_4  6.564757    2
9  Name_9  Subject_4  8.606973    3
**************************************************

In [152]:
HouseOne.groupby("Subject") #returns the groupby object

#### Aggregate Functions

An aggregated function returns a single aggregated value for each group. Once the group by object is created, several aggregation operations can be performed on the grouped data.

#### mean()

groupby() function takes up the column name as an argument followed by the name of the function or by using agg() function.

For the same dataframe,we are grouping the data by Subject and also calculating the mean of the Rating column for each category in the subject.

In [153]:
HouseOne.groupby('Subject')['Rating'].mean()

Subject
Subject_0    8.328984
Subject_1    3.386806
Subject_2    6.655019
Subject_3    6.096036
Subject_4    7.585865
Name: Rating, dtype: float64

In [154]:
HouseOne.groupby('Subject')['Rating'].agg(np.mean)

Subject
Subject_0    8.328984
Subject_1    3.386806
Subject_2    6.655019
Subject_3    6.096036
Subject_4    7.585865
Name: Rating, dtype: float64

#### sum()

groupby() function takes up the column name as argument followed by sum() function.

In [155]:
#Suppose HouseOne is the name of the dataframe. We are grouping the data by Subject 
#and also calculating the sum of the num column for each subject.

HouseOne.groupby('Subject')['Num'].sum()

Subject
Subject_0     9
Subject_1    11
Subject_2     6
Subject_3     9
Subject_4     5
Name: Num, dtype: int32

#### count()

groupby() function takes up the column name as argument followed by count() function.

For the same dataframe, we are grouping the data by Num and also calculating the count of the same column. It will give us the frequency of each number in the num column.

In [156]:
HouseOne.groupby('Num')['Num'].count()

Num
1    3
2    2
3    1
5    1
8    2
9    1
Name: Num, dtype: int64

#### Check the time diffrence & match the values where we looped over group and now where we used short cute method, if the data is big enough this time difference would be significant., try it once by increasing n_rows from 300 to 3,000,000

In [157]:
"""
  There is one rule for Aggregate functions ----::---- Always remember the aggregate function assumes that function that you want to use will return a single value.
  for e.g : 
    for a column -> mean would return a single value which is the average of that column.
    but cant use a function like value_counts, which return multiple values. but i can filter the most/least frequent element from it to return as value see getmeMode function
  You can even pass your custom/user defined function, i am here going to pass a user defined function that returns mode of the series/column

"""
def getMeMode(x):
    return x.value_counts().index[0] # return value of most frequent element. Note: x is the entire column of rating of any particular group, and i am returning a *single* value which mode from my defined function.
  
stats = HouseOne.groupby("Subject")["Rating"].agg({"mean", "median", "count", np.sum, getMeMode}) # instead of np.sum you can also use "sum", getMeMode signifies as the address/refrence of function
stats # columns are returned in random order you can get a proper order by filtering columns in partcular order [ColA, ColB, ..., ColN]

                 sum  getMeMode  count      mean    median
Subject
Subject_0  16.657967   7.722914      2  8.328984  8.328984
Subject_1   6.773613   2.256429      2  3.386806  3.386806
Subject_2  13.310039   5.950969      2  6.655019  6.655019
Subject_3  12.192072   7.097788      2  6.096036  6.096036
Subject_4  15.171729   6.564757      2  7.585865  7.585865

#### Aggregating multiple columns

In [166]:
# here we aggregates individual columns by specifying the dictionary what operation we want also we can pass custom functons here i passed getMeMoode created earlier
HouseOne.groupby("Subject").agg({"mean", "median"})

             Rating            Num
               mean    median mean median
Subject
Subject_0  8.328984  8.328984  4.5    4.5
Subject_1  3.386806  3.386806  5.5    5.5
Subject_2  6.655019  6.655019  3.0    3.0
Subject_3  6.096036  6.096036  4.5    4.5
Subject_4  7.585865  7.585865  2.5    2.5

## Lambda functions in python

In Python, an anonymous function is a function that is defined without a name.
While defining normal functions, we are using the def keyword in Python, but while defining anonymous functions we are using the lambda keyword.
Hence, anonymous functions also are called Lambda functions.

##### syntax. lambda argument(s): expression

A lambda function evaluates an expression for a given argument. We give the function a value (argument) and then provide the operation (expression). The keyword lambda must come first. A full colon (:) separates the argument and the expression.

In [167]:
#normal python function
def a_name(x):
    return x+x

#lambda funciton
lambda x:x+x

#### Implementation of Lambda Function in Python

We use lambda functions when we require a nameless function for a short period of time.

While working with DataFrames, lambda functions can help us in applying any operations on individual values of a series, instead of applying the operation on the series as a whole.

For example -
Letâ€™s say we have a dataframe where a column called Number contains some alpha numeric values, and we want to fetch the first three characters of these values. We can do this easily using lambda functions, which would otherwise be difficult to do.

In [168]:
#We can apply this same operation on each value of the series/column Number without using loops as shown below,

df=pd.DataFrame()
df['Number'] = ['ABC123','AZZ0011','XYZ555']
df

    Number
0   ABC123
1  AZZ0011
2   XYZ555

In [170]:
df['Number_first_3_characters'] = df['Number'].apply(lambda x:x[:3])

In [171]:
df

    Number Number_first_3_characters
0   ABC123                       ABC
1  AZZ0011                       AZZ
2   XYZ555                       XYZ

## Join and Concat

Join is not only one of the most important concepts to master for data manipulation but also one of the easiest.
Let us start by understanding different types of joins,

1) Left Join

2) Right Join

3) Inner Join

4) Outer Join

In [2]:
import pandas as pd

In [3]:
Marks = pd.DataFrame({'name' : ['Walter','White','Saul','Goodman'],
    'marks' : [70,75,80,90]})

In [4]:
Age = pd.DataFrame({'name' : ['Walter','Saul','Goodman','Hank'],
    'age' : [21,22,20,24],
      'Hobby' : ['Cooking', 'Reading', 'Playing','Collecting Minerals']})

Created two dictionaries named Age and Marks and converted them into Dataframes(Tables) on which we are going to perform all the joins.

In [5]:
Marks

      name  marks
0   Walter     70
1    White     75
2     Saul     80
3  Goodman     90

In [6]:
Age

      name  age                Hobby
0   Walter   21              Cooking
1     Saul   22              Reading
2  Goodman   20              Playing
3     Hank   24  Collecting Minerals

### Left join()

In [8]:
Left_Join = pd.merge(Marks, Age, on = 'name', how = 'left')
Left_Join

      name  marks   age    Hobby
0   Walter     70  21.0  Cooking
1    White     75   NaN      NaN
2     Saul     80  22.0  Reading
3  Goodman     90  20.0  Playing

Here we are performing simple Left Join using the tables we just created. Marks here is the left table as we can see in the code. Merge function is used, Age is the right name. By 'on' parameter, we set the id (the basis of the join) and by how we specify the type of join we want to perform.

Left_Join is the resultant table after the operation has been performed. As we can see, all the names from the left table has been retained and the corresponding details of those names has been obtained. 'Hank' from the right(Age) table has been ignored as it is not present in the left table.

In [9]:
#no change in original DataFrames
Marks

      name  marks
0   Walter     70
1    White     75
2     Saul     80
3  Goodman     90

### Right join()

In [10]:
Right_join = pd.merge(Marks,Age,on='name',how='right')
Right_join

      name  marks  age                Hobby
0   Walter   70.0   21              Cooking
1     Saul   80.0   22              Reading
2  Goodman   90.0   20              Playing
3     Hank    NaN   24  Collecting Minerals

Similarly we perform can perform right join, by specifying 'how' as 'right'.

All the names (id) from the right(Age) table has been retained and their corresponding marks as obtained from the left table.

In [12]:
#no change in original DataFrmae
print(Age)
Marks

      name  age                Hobby
0   Walter   21              Cooking
1     Saul   22              Reading
2  Goodman   20              Playing
3     Hank   24  Collecting Minerals

      name  marks
0   Walter     70
1    White     75
2     Saul     80
3  Goodman     90

### Inner join()

Inner Join is slightly different from both of the other joins. It returns a table which have ids (name in our case), which exists in both the tables, in technical terms, it returns the intersection of the both the table based on the id (name).

In [13]:
Inner_join = pd.merge(Marks,Age,on='name',how='inner')
Inner_join

      name  marks  age    Hobby
0   Walter     70   21  Cooking
1     Saul     80   22  Reading
2  Goodman     90   20  Playing

In Inner Join, we can clearly see, it returns a table that consists only of the ids (name) that is common in both the tables. (i.e Walter, Saul and Goodman.)

In [14]:
#no change in original DataFrmae
print(Age)
Marks

      name  age                Hobby
0   Walter   21              Cooking
1     Saul   22              Reading
2  Goodman   20              Playing
3     Hank   24  Collecting Minerals

      name  marks
0   Walter     70
1    White     75
2     Saul     80
3  Goodman     90

### Outer join()

Outer Join, it is just the opposite of Inner Join. In technical terms, it returns all the records from both tables (right and left) based on the id that we set. It is the Union of both the tables.

In [16]:
Outer_join = pd.merge(Age,Marks,on='name',how='outer')
Outer_join

      name   age                Hobby  marks
0   Walter  21.0              Cooking   70.0
1     Saul  22.0              Reading   80.0
2  Goodman  20.0              Playing   90.0
3     Hank  24.0  Collecting Minerals    NaN
4    White   NaN                  NaN   75.0

In [18]:
Outer_join = pd.merge(Marks,Age,on='name',how='outer')
Outer_join

      name  marks   age                Hobby
0   Walter   70.0  21.0              Cooking
1    White   75.0   NaN                  NaN
2     Saul   80.0  22.0              Reading
3  Goodman   90.0  20.0              Playing
4     Hank    NaN  24.0  Collecting Minerals

Note : NaN is Null, since the marks for â€˜Hankâ€™ are not present. Similarly, the age and hobby of â€˜Whiteâ€™ is not known.

![joins.webp](attachment:joins.webp)

In this image, Venn Diagrams of all the joins are present for effective visualization of different types of joins.

### Concat

The concat function does all of the heavy lifting of performing concatenation operations along an axis.
You can vertically/horizontally concat any number of tables by using this function from pandas library.

In [19]:
Marks1 = pd.DataFrame({'name' : ['Walter','White','Saul','Goodman'],
    'marks' : [70,75,80,90]})

In [20]:
Marks2 = pd.DataFrame({'name' : ['Hank','Pinkman','Mike','Fring'],
    'marks' : [88,72,75,90]})

In [22]:
Marks1

      name  marks
0   Walter     70
1    White     75
2     Saul     80
3  Goodman     90

In [23]:
Marks2

      name  marks
0     Hank     88
1  Pinkman     72
2     Mike     75
3    Fring     90

In [25]:
#axis=0 is for vertical and fo horizontal axis-1
Vertical_concat=pd.concat([Marks1,Marks2],axis=0,ignore_index=True)
Vertical_concat

      name  marks
0   Walter     70
1    White     75
2     Saul     80
3  Goodman     90
4     Hank     88
5  Pinkman     72
6     Mike     75
7    Fring     90

After Concatenation on the axis = 0, that is vertically, we get a table that is a result of the vertical concatenation of both Marks1 and Marks2.

In [27]:
Marks1 = pd.DataFrame({'name' : ['Walter','White','Saul','Goodman'],
    'marks' : [70,75,80,90]})

In [28]:
Age = pd.DataFrame({'hobby' : ['Cooking', 'Reading', 'Playing','Collecting Minerals']
                   ,'age' : [10,20,30,40]})

In [31]:
#horizontal concat using axis=1
Horizontal_concat=pd.concat([Marks1,Marks2],axis=1)
Horizontal_concat

      name  marks     name  marks
0   Walter     70     Hank     88
1    White     75  Pinkman     72
2     Saul     80     Mike     75
3  Goodman     90    Fring     90

In [32]:
# other way of concatinating directly with or without setting ignore_index=True
pd.concat([Marks1,Marks2],axis=1,ignore_index=True)

         0   1        2   3
0   Walter  70     Hank  88
1    White  75  Pinkman  72
2     Saul  80     Mike  75
3  Goodman  90    Fring  90

## Some Basic Functions

In [52]:
emp=pd.read_csv('employees.csv')

In [53]:
emp

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,NaN
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance
3,Jerry,Male,3/4/2005,1:00 PM,138705,9.340,True,Finance
4,Larry,Male,1/24/1998,4:47 PM,101004,1.389,True,Client Services
...,...,...,...,...,...,...,...,...
995,Henry,NaN,11/23/2014,6:09 AM,132483,16.655,False,Distribution
996,Phillip,Male,1/31/1984,6:30 AM,42392,19.675,False,Finance
997,Russell,Male,5/20/2013,12:39 PM,96914,1.421,False,Product
998,Larry,Male,4/20/2013,4:45 PM,60500,11.985,False,Business Development
999,Albert,Male,5/15/2012,6:24 PM,129949,10.169,True,Sales

In [54]:
#display first 5 rows of dataset
emp.head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,NaN
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance
3,Jerry,Male,3/4/2005,1:00 PM,138705,9.340,True,Finance
4,Larry,Male,1/24/1998,4:47 PM,101004,1.389,True,Client Services

### Unique function - unique()

unique() function is used to return unique values from a 1D array. This method works only on a single column and not on whole Data Frames. This method includes NULL value as a unique value.

#### Syntax: Series.unique()
#### Dataframe.column.unique()
#### Return Type: Numpy array of unique values in that column

In [55]:
#applying unique function on series i.e Team column of dataframe emp

emp.Team.unique()

array(['Marketing', nan, 'Finance', 'Client Services', 'Legal', 'Product',
       'Engineering', 'Business Development', 'Human Resources', 'Sales',
       'Distribution'], dtype=object)

In [56]:
# unique function with series
A=pd.Series([1,2,3,4,5,6,3,2,5,5,7])
A.unique()

array([1, 2, 3, 4, 5, 6, 7], dtype=int64)

### Nunique function - nunique()

nunique() function is used to find the number of unique values  in a series. This method works only on a single column and not on whole Data Frames. It counts null value as a unique value.

#### Syntax: Series.nunique(axis=0, dropna=True)
####             DataFrame.column.nunique( dropna=True)

#### Parameters :
axis : {0 or â€˜indexâ€™, 1 or â€˜columnsâ€™}, default 0.

dropna : Donâ€™t include NaN in the counts.

In [58]:
#with Series
A.nunique()

7

In [59]:
#with DataFrame
emp.Team.nunique()

10

The nunique function gives count of unique values in the series

### Value counts function - value_counts()

value_counts() function returns a Series containing counts of unique values. The result will be in descending order ,i.e. the first element is the most frequently-occurring element.

#### Syntax: Series.value_counts(normalize=False, sort=True, ascending=False, bins=None, dropna=True)

#### Parameter:
normalize : If True then the object returned will contain the relative frequencies of the unique values.

sort : Sort by values.

ascending : Sort in ascending order.

dropna : Donâ€™t include counts of NaN.

In [60]:
#with Series
A.value_counts()

5    3
3    2
2    2
7    1
6    1
4    1
1    1
dtype: int64

The value counts function gives no of time each values is occuring in the series

In [62]:
#using DataFrame
#applying value counts function on Team column of emp
emp.Team.value_counts()

Client Services         106
Finance                 102
Business Development    101
Marketing                98
Product                  95
Sales                    94
Engineering              92
Human Resources          91
Distribution             90
Legal                    88
Name: Team, dtype: int64

### Describe function - describe()

The describe() method is used for calculating some statistical data like percentile, mean and std of the numerical values of the Series or DataFrame. It analyzes both numeric and object series and also the DataFrame column sets of mixed data types.

#### Syntax: Series.describe(percentiles=None, include=None, exclude=None)

#### Parameters:

percentile: list like data type of numbers between 0-1 to return the respective percentile

include: List of data types to be included while describing dataframe. Default is None

exclude: List of data types to be Excluded while describing dataframe. Default is None

In [63]:
#using Series
A.describe()

count    11.000000
mean      3.909091
std       1.868397
min       1.000000
25%       2.500000
50%       4.000000
75%       5.000000
max       7.000000
dtype: float64

The describe() method is used for calculating some statistical data like percentile, mean and std of the numerical values of the Series or DataFrame.

In [64]:
#using DataFrame
emp.Salary.describe()

count      1000.000000
mean      90662.181000
std       32923.693342
min       35013.000000
25%       62613.000000
50%       90428.000000
75%      118740.250000
max      149908.000000
Name: Salary, dtype: float64

### Isin function - isin()

The isin() function is used to check whether each element in the DataFrame or Series is contained in values or not.

#### Syntax: DataFrame.isin(values)

#### Parameters:
values: iterable, Series, List, Tuple, DataFrame or dictionary to check in the caller Series/Data Frame.

In [72]:
# using series
A.isin(range(1,4))

0      True
1      True
2      True
3     False
4     False
5     False
6      True
7      True
8     False
9     False
10    False
dtype: bool

The isin() function is used to check whether each element in the DataFrame or Series is contained in values or not.

In [73]:
#using DataFrame
#here we are checking in the 'Team' column for 'Marketing' attribute present or not
emp['Team'].isin(['Marketing'])

0       True
1      False
2      False
3      False
4      False
       ...
995    False
996    False
997    False
998    False
999    False
Name: Team, Length: 1000, dtype: bool

In [74]:
# fetch all rows where Team is marketing or sales
emp[emp['Team'].isin(['Marketing','Sales'])]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing
13,Gary,Male,1/27/2008,11:40 PM,109831,5.831,False,Sales
21,Matthew,Male,9/5/1995,2:12 AM,100612,13.645,False,Marketing
26,Craig,Male,2/27/2000,7:45 AM,37598,7.757,True,Marketing
35,Theresa,Female,10/10/2006,1:12 AM,85182,16.675,False,Sales
...,...,...,...,...,...,...,...,...
975,Susan,Female,4/7/1995,10:05 PM,92436,12.467,False,Sales
986,Donna,Female,11/26/1982,7:04 AM,82871,17.999,False,Marketing
991,Rose,Female,8/25/2002,5:12 AM,134505,11.051,True,Marketing
994,George,Male,6/21/2013,5:47 PM,98874,4.479,True,Marketing
999,Albert,Male,5/15/2012,6:24 PM,129949,10.169,True,Sales

In [76]:
#last 5 rows
emp.tail()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
995,Henry,NaN,11/23/2014,6:09 AM,132483,16.655,False,Distribution
996,Phillip,Male,1/31/1984,6:30 AM,42392,19.675,False,Finance
997,Russell,Male,5/20/2013,12:39 PM,96914,1.421,False,Product
998,Larry,Male,4/20/2013,4:45 PM,60500,11.985,False,Business Development
999,Albert,Male,5/15/2012,6:24 PM,129949,10.169,True,Sales

### Enumerate and Zip

#### Enumerate 
Often, when dealing with iterators, we also get a need to keep a count of iterations.Python eases the programmersâ€™ task by providing a built-in function enumerate() for this task. Enumerate() method adds a counter to an iterable and returns it in a form of enumerate object.
Enumerate() method adds a counter to an iterable and returns it in the form of an enumerating object. This enumerated object can then be used directly for loops or converted into a list of tuples using the list() method.

#### Syntax :    enumerate(iterable, start=0)

#### Parameters :
Iterable: any object that supports iteration.

Start: the index value from which the counter is to be started, by default it is 0.

In [78]:
#using enumerate object in lists
l1=["eat","sleep","repeat"]
s1 = "code"

#creating enumerate objects
obj1= enumerate(l1)
obj2= enumerate(s1)

#printing the type
print(" Return type of enumerate object is: ",type(obj1))

#printing the list 1 with the enumerate
print(list(enumerate(l1)))
print(list(enumerate(s1)))

#changing the starting index to 11 from 0
print(list(enumerate(l1,11)))
print(list(enumerate(s1,11)))

 Return type of enumerate object is:  <class 'enumerate'>
[(0, 'eat'), (1, 'sleep'), (2, 'repeat')]
[(0, 'c'), (1, 'o'), (2, 'd'), (3, 'e')]
[(11, 'eat'), (12, 'sleep'), (13, 'repeat')]
[(11, 'c'), (12, 'o'), (13, 'd'), (14, 'e')]

### Zip

zip is a container itself. It holds the real file inside.
Similarly,the purpose of the Python zip() method is to map the similar index of multiple containers so that they can be used just as a single entity. Python zip() takes iterable elements as input, and returns an iterator. If it gets no iterable elements, it returns an empty iterator.

#### Syntax :  zip(*iterators) 

#### Parameters : 
Python iterables or containers ( list, string etc ) 

#### Return Value : 
Returns a single iterator object, having mapped values from all the containers.

In [79]:
list1 = ['alpha','beta','gamma','sigma']
list2 = ['one','two','three','six']

#zipping the lists or the values
test = zip(list1,list2)

print('\nPrinting the values of zip\n')
for values in test:
    print(values) #print each tuples

Printing the values of zip

('alpha', 'one')
('beta', 'two')
('gamma', 'three')
('sigma', 'six')

In [80]:
list1 = ['John','Job','Mike','Steve']
list2 = ['one','two','three','four','five']

#zipping the lists or the values
test = zip(list1,list2)

print('\nPrinting the values of zip\n')
for values in test:
    print(values) #print each tuples

Printing the values of zip

('John', 'one')
('Job', 'two')
('Mike', 'three')
('Steve', 'four')